tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "mas"

# Essencial

mas "Whatsapp", id: 1147396723
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Twitter", id: 1482454543

cask "google-chrome"
cask "raycast"
cask "spotify"
cask "discord"
cask "zoom"

# Design

cask "figma"

# Dev
# mas "Slack", id: 803453959

brew "node"
brew "gh"
brew "pure"
brew "zsh-syntax-highlighting"
brew "gnupg"

cask "visual-studio-code"
cask "tower"
cask "paw"
cask "sf-symbols"
cask "font-jetbrains-mono"
cask "jetbrains-toolbox"
# cask "webstorm"

# Android Dev

cask "android-studio"
brew "scrcpy"

# iOS Dev

mas "Xcode", id: 497799835
mas "Developer", id: 640199958
# brew "swiftlint"