tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "mas"

# Essencial
cask "google-chrome"
mas "Twitter", id: 1482454543
# mas "Whatsapp", id: 1147396723
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# cask "spotify"
# cask "discord"
# cask "zoom"

# Design
# cask "figma"

# Office & Productivity
cask "raycast"
mas "Slack", id: 803453959
cask "notion"
cask "microsoft-teams"
cask "microsoft-outlook"

# Dev
cask "visual-studio-code"
brew "node"
brew "gh"
# brew "pure"
# brew "zsh-syntax-highlighting"
# brew "gnupg"
# brew "bazel"
# brew "gradle"
# cask "github"
cask "tower"
# cask "paw"
cask "sf-symbols"
cask "font-jetbrains-mono"
# cask "jetbrains-toolbox"
# cask "intellij-idea"
# cask "webstorm"
# cask "oracle-jdk"

# Android Dev
cask "android-studio"
brew "scrcpy"

# iOS Dev
mas "Xcode", id: 497799835
mas "Developer", id: 640199958
brew "cocoapods"
# brew "swiftlint"